package com.$18_Gather.Comprehensive_exercise;

/*
    随机点名器四:
        TXT文件中实现准备好80个学生姓名, 每个学生的名字独占一行
        要求: 每次被点到的学生, 再次被点到的概率在原先的基础上降低一半
        举例: 80个学生, 点名5次, 每次都点到小A, 概率变化情况如下:
            第一次每人概率: 1.25%
            第二次小A概率: 0.625%; 其他学生概率: 1.2579%
            第三次小A概率: 0.3125%; 其他学生概率: 1.261867%
            第二次小A概率: 0.15625%; 其他学生概率: 1.2638449%
            第二次小A概率: 0.078125%; 其他学生概率: 1.26483386%
        作弊要求: 第三次点名一定是张三
        提示:
            需要用到集合, IO, 权重随机算法
 */

public class $4_RollCall_Four {
}
